{
    "_startInitPage-texts-en_US":"",
    "cardApresentation": "- Welcome to my personal website! Here you will find my personal universe, get to know me and see what I have worked on and am currently working on. \n You will also see what I have studied and am currently studying! All this to make you comfortable if you want to hire me or make a partnership.",
    "_endtInitPage-texts-en_US":"",

    "_startHomePage-texts-en_US":"",
        "apresentation": "-Welcome to my personal website! My name is Lucas, I am 21 years old and passionate about technology. \n Since childhood, I've always wanted to understand how things work in technology, from the creation of apps, websites, and games. And here I am now, with my first website that I created by myself, always seeking to evolve more and more.",

        "jump_to_portfolio":"If you want to know some Works I've done, just click on the button below ⬇ \n If you want to know a little more about me, just scroll down a little further",

        "more_about_me": "-As you already know, my name is Lucas and I am passionate about Information Technology. This is such a vast world and if I could, I would want to learn every possible area within it! I am passionate about Artificial Intelligence, Information Security, and robotics, in addition to also being fascinated by hardware issues. However, I know that I need to keep my feet on the ground and specialize in one or even two areas, otherwise, I would get lost. \n  -Currently, I am focusing on learning how to develop cross-platform apps, but before that, I studied information security and learned a lot about this subject. I believe that all programmers should understand the basics of information security to create safer apps for their users. In the future, I would like to specialize in mobile app security and Android systems. These are my current plans. \n -If you scroll down a bit more, you will see a button to a page on my site, where you will find more details about the skills I possess and the level of each one!",
    "_endtHomePage-texts-en_US":"",

    "_startPortfolioPage-texts-en_US":"",
        "desc_video_1":"- A personal project of mine, where I'm slowly making a Football Coach Simulator game ⚽. \n - Why am I doing it little by little? I'm doing it little by little because I still have a lot to learn, and as I learn, more things I add to the game. At the moment I'm doing it 'alone' which makes the process slower, I put it alone in quotes because I'm getting help from a friend I met and when I can't solve a code problem he gives me strength, and with that I'm learning each again, so when I say I'm doing it alone it's because I still don't have a team putting ideas and code together with me. \n - If you want to know more about the Project, just click on the 'FootBall Manager' button above.",

        "desc_video_2":"- A project made together with the professor of a course I took, serves as a portfolio for me to show the things I learned doing this project, the code is not 100% the same as the professor's because I changed a few things, but for sure I'm going to make a shop 2.0 later with a code 100% mine, if you want to know more about this project and know what I learned doing it just click on the button above written 'Shop App'",

        "_startAppShop_desc-texts-en_US":"",
            "course_info":"COURSE THAT THIS APP WAS DEVELOPED: \n This app was developed alongside Professor Leonardo from Cod3r, a programming course platform. I followed his recorded classes and developed the app alongside him. This wasn't the only app I developed in the course, but it was the most complete as it was the penultimate app of the course where he covered more things, and combining all the things that had already been taught in the simpler apps at the beginning. The course has a duration of 54 hours, but of course, by studying and coding along with him and solving challenges, I spent a total of 135 hours studying. I know this because I keep track of all my study/work time on this site: ",
        "_endAppShop_desc-texts-en_US":"",
        
    "_endPortfolioPage-texts-en_US":""
   
}