{
    
    "_startInitPage-texts-pt_BR":"",
    "cardApresentation": "- Seja bem-vindo ao meu site pessoal! Aqui você encontrará o meu universo particular, conhecerá quem eu sou e verá o que já trabalhei e estou trabalhando. \n Além disso, verá o que estudei e o que estou estudando. Tudo isso para que você fique confortável em me contratar ou fazer parceria.",
    "_endtInitPage-texts-pt_BR":"",


    "_startHomePage-texts-pt_BR":"",
        "apresentation": "-Seja bem-vindo ao meu site pessoal! Meu nome é Lucas, tenho 21 anos e sou apaixonado por tecnologia. \n Desde criança, sempre quis entender como funcionavam as coisas na tecnologia, desde a criação de aplicativos, sites e jogos. E aqui estou, agora, com o meu primeiro site que criei sozinho, buscando sempre evoluir cada vez mais.",

        "jump_to_portfolio":"Se quiser conhecer uns Trabalhos que já fiz, é só clicar no botão que está aqui a baixo ⬇ \n Caso queira saber um pouco mais sobre mim é só descer um pouquinho mais",

        "more_about_me": " -Como você já sabe, meu nome é Lucas e sou apaixonado por Tecnologia da Informação. Este é um mundo tão vasto e, se pudesse, eu gostaria de aprender cada área possível dentro dele! Tenho paixão por Inteligência Artificial, Segurança da Informação e robótica, além de também ser fascinado por questões de hardware. No entanto, eu sei que preciso ter os pés no chão e me especializar em uma ou até mesmo duas áreas, caso contrário, me perderia. \n  -Atualmente, estou me concentrando em aprender a desenvolver aplicativos multiplataforma, mas antes disso, estudei segurança da informação e aprendi muito sobre este assunto. Acredito que todos os programadores deveriam entender as bases de segurança da informação para criar aplicativos mais seguros para seus usuários. No futuro, gostaria de me especializar em segurança de aplicativos mobile e sistemas Android. Esses são meus planos atuais. \n -Se rolar um pouco mais a baixo, verá um botão para uma página do meu site, onde irá encontrar mais detalhes sobre as habilidades que eu possuo e o nível de cada uma! ",

    "_endtHomePage-texts-pt_BR":"",

    "_startPortfolioPage-texts-pt_BR":"",
        "desc_video_1":"- Um Projeto pessoal meu, onde estou fazendo aos poucos um joguinho Simulador de Técnico de Futebol ⚽. \n - Por que estou fazendo aos poucos? Estou fazendo aos poucos porque ainda tenho muito a aprender, e conforme eu vou aprendendo, mais coisas vou adicionando ao game. No momento estou fazendo 'sozinho' o que deixa o processo mais lento, coloquei sozinho entre aspas pois estou recebendo uma ajuda de um amigo que conheci e quando não consigo resolver um problema de código ele me da uma força, e com isso vou aprendendo cada vez mais, então quando eu digo que estou fazendo sozinho é porque ainda não tenho uma equipe montando ideias e código junto comigo. \n - Se quiser saber mais sobre o Projeto é só clicar no botão 'FootBall Manager' que se encontra a cima.",

        "desc_video_2":"- Um projeto feito junto com o professor de um curso que eu fiz, serve de portfólio para eu mostrar as coisas que eu aprendi fazendo esse projeto, o codigo não está 100% igual a do professor pois eu mudei umas coisinhas mínimas, mas com certeza vou fazer um shop 2.0 mais pra frente com um codigo 100% meu, se quiser saber mais sobre esse projeto e saber o que eu aprendi fazendo ele é só clicar no botão a cima escrito 'Shop App'",
        "_startAppShop_desc-texts-pt_BR":"",
            "course_info":"   CURSO QUE FOI DESENVOLVIDO ESSE APP: \n  Esse aplicativo foi desenvolvido juntamente ao Professor Leonardo da Cod3r, uma plataforma de cursos de programação, acompanhei as aulas gravadas dele e fui desenvolvendo o aplicativo junto à ele. Não foi só esse aplicativo que desenvolvi no curso, mas esse foi o mais completo, pois ele foi o penúltimo app do curso onde ele abordava mais coisas, e juntando todas as coisas que já havia sido ensinado nos aplicativos mais simples do começo. o curso tem duração de 54 horas mas claro que estudando, e codando junto com ele e resolvendo desafios eu fiquei estudando bruto mesmo 135 horas. Sei disso pois anoto todo meu tempo de estudos/trabalhos nesse site: ",

            "app_FeaturesDescription":"  O aplicativo chamado Shop é uma simulação de como um aplicativo de compras online deveria funcionar. No entanto por ser um app simulado para afim de ser um portfólio, ele não oferece todas as funcionalidades de um aplicativo de compras online real. Algumas coisas que ele não oferece incluem produtos reais, opções de pagamento, opção de personalizar o perfil e opção de definir o local de entrega do produto. \n\n Entre as funcionalidades que o aplicativo de simulação oferece, estão: [ simulação de produtos, aba para adicionar produtos (que só o proprietário do aplicativo tem acesso para adicionar e definir o preço), opção de colocar os produtos simulados no carrinho, opção de marcar como favoritos e opção de cadastro de usuários. \n],      \n\n Recursos técnicos do aplicativo: [\n Se você está lendo isso e não entende muito ou não entende nada sobre como um aplicativo é construído, não fique com medo de ler. Vou tentar ser bem didático. Alocação do servidor: {\n Qualquer aplicativo online precisa usar um servidor. O servidor usado aqui é o Firebase, da própria Google, mas outros servidores também podem ser usados para alocar o aplicativo. No servidor, é possível armazenar qualquer dado do aplicativo, como produtos vendidos, usuários e os próprios dados gerados pelo aplicativo, como itens adicionados ao carrinho, itens marcados como favoritos e compras feitas. Por isso, é necessário um servidor para armazenar todos esses dados. }\n], \n\n Layouts:[\n no aplicativo foi adicionadas pequenas animações para deixar o app agradável de se mexer, isso é pensado no usuário que irá usar o aplicativo para um maior conforto digamos assim, e deixar uma experiência agradável para o mesmo. Até porque o aplicativo tem que ser pensado no usuário final. que no caso aqui são clientes de uma loja virtual.\n], \n\n",
            
            "whatI_learned-text":"Esta seção é direcionada para profissionais técnicos de empresas interessadas em contratar os meus serviços. No entanto, se você não é especialista no assunto, sinta-se à vontade para continuar lendo e aprendendo mais sobre o assunto, pois se você quer me contratar e não entende nada do assunto, aprendendo um pouquinho só sobre o que eu sei fazer pode lhe deixar confortável para me contratar. \n\n *Aprendi gerenciamento de estado com o Provider \n\n *Aprendi a utilizar o Firebase para armazenar dados, o que me permitiu armazenar tanto os dados de usuário quanto os dados gerados pelo aplicativo \n\n *Aprendi a usar API do firebase e com isso tenho uma noção de como usar outras API's em outros projetos \n\n *Aprendi a enviar solicitações do aplicativo para o servidor, com autenticação adequada, para obter os dados do usuário de forma segura. Isso garante que apenas o usuário autenticado tenha acesso a seus próprios dados, sem comprometer a privacidade de outros usuários. \n\n  *Aprendi a enviar os dados para o servidor e a armazená-los em categorias distintas, de modo a facilitar a organização e acesso a esses dados.",
            "final_observations-text":"O link para download do aplicativo está disponível logo abaixo. Se você quiser contratar meus serviços, basta acessar a página de contrato, localizada logo abaixo, para verificar o preço atual que estou cobrando. Caso precise entrar em contato comigo, basta acessar o rodapé do site ou a própria página de contrato, onde você encontrará meus dados de contato. \n\n ATENÇÃO: VOCÊ SERÁ REDIRECIONADO PARA O MEU GOOGLE DRIVE ASSIM QUE CLICAR NO BOTÃO DE DOWNLOAD ABAIXO. PODE BAIXAR O APLICATIVO SEM MEDO, ELE NÃO POSSUI VIRUS. QUANDO VOCÊ INSTALAR, VERÁ QUE ELE NÃO PEDE NENHUMA INFORMAÇÃO ADICIONAL, POIS É UM APLICATIVO DE SIMULAÇÃO. ISSO NÃO SIGNIFICA QUE APLICATIVOS QUE PEDEM PERMISSÃO TENHAM VIRUS, MAS COMO EU AINDA NÃO SOU UMA EMPRESA, ALGUMAS PESSOAS PODEM TER MEDO DE BAIXAR. POR ISSO, ESTOU DEIXANDO ESTE TEXTO DE EXPLICAÇÃO. OBRIGADO!",
            "moreInfo-text":"",
                "whatIs_API-text":"API, ou 'Application Programming Interface', é uma forma de permitir que diferentes sistemas e aplicativos se comuniquem entre si. Imagine que você tem um aplicativo que precisa acessar dados de um site de notícias. Em vez de ter que fazer o download de todas as notícias do site e armazená-las no seu aplicativo, você pode usar uma API para acessar esses dados diretamente do site. \n\n Essencialmente, uma API é um conjunto de regras e padrões que permitem que diferentes sistemas se comuniquem e troquem informações de maneira eficiente e segura. As APIs são muito comuns na indústria de tecnologia e são amplamente utilizadas para integrar diferentes aplicativos e sistemas. Ou seja é muito útil usar uma API em um aplicativo principalmente quando você pega uma API pronta na internet que pode trazer funcionalidades interessantes ao aplicativo sem ter que perder tempo programando essa funcionalidade por exemplo.",
        "_endAppShop_desc-texts-pt_BR":"",
        
    "_endPortfolioPage-texts-pt_BR":""
    
   
}