{
    
    "_startInitPage-texts-pt_BR":"",
        "cardApresentation": "- Seja bem vindo ao meu site pessoal, aqui você irá encontrar meu universo particular, vai me conhecer e ver no que já trabalhei e estou trabalhando. \n Irá também ver o que estudei e estou estudando! Tudo isso para poder ficar confortável caso queira me contratar ou fazer parceria!",
    "_endtInitPage-texts-pt_BR":"",


    "_startHomePage-texts-pt_BR":"",
        "apresentation": "-Olá Seja bem vindo ao meu site pessoal! Me chamo Lucas, Tenho 21 anos e Amo Tecnologia! \n -Dês de criança queria saber como as coisas em tecnologia funcionam, como é feito os apps, Sites e jogos, e cá estou agora, com o primeiro site que eu mesmo criei em busca de evoluir cada vez mais.",

        "jump_to_portfolio":"Se quiser conhecer uns Trabalhos que já fiz, é só clicar no botão que está aqui a baixo ⬇ \n Caso queira saber um pouco mais sobre mim é só descer um pouquinho mais",

        "more_about_me": " -Como você já sabe me chamo Lucas, e já sabe que sou apaixonado por Tecnologia. Tecnologia da Informação é um mundo muito grande e se eu pudesse aprenderia cada área possível existente em TI! Sou apaixonado por Inteligência Artificial, Segurança da informação e robótica que também sou fascinado, questões de Hardware também tenho bastante interesse. Mas sei que tenho que ter pé no chão e me especializar em uma área ou até duas quem sabe, rsrs. \n -Agora estou focando em aprender a desenvolver apps em multiplataforma, mas antes disso eu estava estudando segurança da informação, aprendi bastante coisas básicas sobre, e acho que todo programador pelo menos tinha que entender a base da segurança da informação para poder programar apps mais seguros para seus usuários, mas isso já é outra conversa. Mais para frente quero me especializar em segurança de aplicativos mobile e sistemas android, esses são meus planos por enquanto.",

    "_endtHomePage-texts-pt_BR":"",

    "_startPortfolioPage-texts-pt_BR":"",
        "desc_video_1":"- Um Projeto pessoal meu, onde estou fazendo aos poucos um joguinho Simulador de Técnico de Futebol ⚽. \n - Por que estou fazendo aos poucos? Estou fazendo aos poucos porque ainda tenho muito a aprender, e conforme eu vou aprendendo, mais coisas vou adicionando ao game. No momento estou fazendo 'sozinho' o que deixa o processo mais lento, coloquei sozinho entre aspas pois estou recebendo uma ajuda de um amigo que conheci e quando não consigo resolver um problema de código ele me da uma força, e com isso vou aprendendo cada vez mais, então quando eu digo que estou fazendo sozinho é porque ainda não tenho uma equipe montando ideias e código junto comigo. \n - Se quiser saber mais sobre o Projeto é só clicar no botão 'FootBall Manager' que se encontra a cima.",

        "desc_video_2":"- Um projeto feito junto com o professor de um curso que eu fiz, serve de portfólio para eu mostrar as coisas que eu aprendi fazendo esse projeto, o codigo não está 100% igual a do professor pois eu mudei umas coisinhas mínimas, mas com certeza vou fazer um shop 2.0 mais pra frente com um codigo 100% meu, se quiser saber mais sobre esse projeto e saber o que eu aprendi fazendo ele é só clicar no botão a cima escrito 'Shop App'",
        "_startAppShop_desc-texts-pt_BR":"",
            "course_info":"   CURSO QUE FOI DESENVOLVIDO ESSE APP: \n  Esse aplicativo foi desenvolvido juntamente ao Professor Leonardo da Cod3r, uma plataforma de cursos de programação, acompanhei as aulas gravadas dele e fui desenvolvendo o aplicativo junto à ele. Não foi só esse aplicativo que desenvolvi no curso, mas esse foi o mais completo, pois ele foi o penúltimo app do curso onde ele abordava mais coisas, e juntando todas as coisas que já havia sido ensinado nos aplicativos mais simples do começo. o curso tem duração de 54 horas mas claro que estudando, e codando junto com ele e resolvendo desafios eu fiquei estudando bruto mesmo 135 horas. Sei disso pois anoto todo meu tempo de estudos/trabalhos nesse site: ",

            "app_FeaturesDescription":"  O aplicativo chamado Shop é uma simulação de como um aplicativo de compras online deveria funcionar. No entanto por ser um app simulado para afim de ser um portfólio, ele não oferece todas as funcionalidades de um aplicativo de compras online real. Algumas coisas que ele não oferece incluem produtos reais, opções de pagamento, opção de personalizar o perfil e opção de definir o local de entrega do produto. \n\n Entre as funcionalidades que o aplicativo de simulação oferece, estão: [ simulação de produtos, aba para adicionar produtos (que só o proprietário do aplicativo tem acesso para adicionar e definir o preço), opção de colocar os produtos simulados no carrinho, opção de marcar como favoritos e opção de cadastro de usuários. \n],      \n\n Recursos técnicos do aplicativo: [\n Se você está lendo isso e não entende muito ou não entende nada sobre como um aplicativo é construído, não fique com medo de ler. Vou tentar ser bem didático. Alocação do servidor: {\n Qualquer aplicativo online precisa usar um servidor. O servidor usado aqui é o Firebase, da própria Google, mas outros servidores também podem ser usados para alocar o aplicativo. No servidor, é possível armazenar qualquer dado do aplicativo, como produtos vendidos, usuários e os próprios dados gerados pelo aplicativo, como itens adicionados ao carrinho, itens marcados como favoritos e compras feitas. Por isso, é necessário um servidor para armazenar todos esses dados. }\n], \n\n Layouts:[\n no aplicativo foi adicionadas pequenas animações para deixar o app agradável de se mexer, isso é pensado no usuário que irá usar o aplicativo para um maior conforto digamos assim, e deixar uma experiência agradável para o mesmo. Até porque o aplicativo tem que ser pensado no usuário final. que no caso aqui são clientes de uma loja virtual.\n], \n\n",
            
            "whatI_learned-text":"Esta seção é direcionada para profissionais técnicos de empresas interessadas em contratar os meus serviços. No entanto, se você não é especialista no assunto, sinta-se à vontade para continuar lendo e aprendendo mais sobre o assunto, pois se você quer me contratar e não entende nada do assunto, aprendendo um pouquinho só sobre o que eu sei fazer pode lhe deixar confortável para me contratar. \n\n *Aprendi gerenciamento de estado com o Provider \n\n *Aprendi a utilizar o Firebase para armazenar dados, o que me permitiu armazenar tanto os dados de usuário quanto os dados gerados pelo aplicativo \n\n *Aprendi a usar API do firebase e com isso tenho uma noção de como usar outras API's em outros projetos \n\n *Aprendi a enviar solicitações do aplicativo para o servidor, com autenticação adequada, para obter os dados do usuário de forma segura. Isso garante que apenas o usuário autenticado tenha acesso a seus próprios dados, sem comprometer a privacidade de outros usuários. \n\n  *Aprendi a enviar os dados para o servidor e a armazená-los em categorias distintas, de modo a facilitar a organização e acesso a esses dados.",
            "final_observations-text":"O link para download do aplicativo está disponível logo abaixo. Se você quiser contratar meus serviços, basta acessar a página de contrato, localizada logo abaixo, para verificar o preço atual que estou cobrando. Caso precise entrar em contato comigo, basta acessar o rodapé do site ou a própria página de contrato, onde você encontrará meus dados de contato.",
            "moreInfo-text":"",
                "whatIs_API-text":"API, ou 'Application Programming Interface', é uma forma de permitir que diferentes sistemas e aplicativos se comuniquem entre si. Imagine que você tem um aplicativo que precisa acessar dados de um site de notícias. Em vez de ter que fazer o download de todas as notícias do site e armazená-las no seu aplicativo, você pode usar uma API para acessar esses dados diretamente do site. \n\n Essencialmente, uma API é um conjunto de regras e padrões que permitem que diferentes sistemas se comuniquem e troquem informações de maneira eficiente e segura. As APIs são muito comuns na indústria de tecnologia e são amplamente utilizadas para integrar diferentes aplicativos e sistemas. Ou seja é muito útil usar uma API em um aplicativo principalmente quando você pega uma API pronta na internet que pode trazer funcionalidades interessantes ao aplicativo sem ter que perder tempo programando essa funcionalidade por exemplo.",
        "_endAppShop_desc-texts-pt_BR":"",
        
    "_endPortfolioPage-texts-pt_BR":""
    
   
}